# GetLegend Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialFieldManager..::..GetLegend Method
SpatialFieldManager Class See Also
---
Returns legend element or NULL
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalysisDisplayLegend GetLegend()
```

Visual Basic
---
```text
Public Function GetLegend As AnalysisDisplayLegend
```

Visual C++
---
```text
public:
AnalysisDisplayLegend^ GetLegend()
```

# ### Return Value
The legend element or NULL
# See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace